{
    "header": {
        "title": "Still life",
        "author": "Daniel Cho",
        "date": "Sept. 8, 2021"
    },
    "body": [
        "![Final still life painting](art/still-final.webp)",
        "This painting draws inspiration from several artistic traditions, primarily still life and history painting. During the Renaissance, still life paintings often depicted opulent arrangements of fruit, silverware, and other luxurious objects, meticulously rendered that luxury. I wanted to create something in a similar vein characteristic of these classical works.",
        "Beyond still life, I was also influenced by history painting, which was historically regarded as the highest form of painting, often depicting biblical or mythological narratives. While I'm not the most religious of people, I find that incorporating some kind of narrative element to a work enhances it. With this in mind, I selected objects that vaguely allude to religious themes.",
        "In addition to composition and storytelling, the final element to get right at the beginning of a painting is color. It's something I struggle with quite a bit, sometimes picking too many poorly harmonized colors, too few, placing them in strange places, and so much more. It is often easy to get distracted when you're also thinking about composition, form, lighting, and all the other fundamentals.",
        "![Final still life painting](art/still-sketch.webp)",
        "With these elements in mind, I start with a few composition sketches, iterating about 4-5 variations until picking the most coherent (usually the first one but it's always good to have options). The one I chose has a very natural triangular composition, with the bust at the top, the apple at the right, and the pot of flowers on the left. There's an almost cirular flow to the composition which I really liked in this composition. While rendering a painting, I try to keep this initial sketch somewhere in view so I can keep going back and make sure it stays true to the original composition. Too many times I look at an original sketch and feel like it's just better, which is a pretty disappointing feeling after sinking several hours into a painting. So, keeping a copy is of the sketch is generally quite nice when trying to capture that original feeling.",
        "Now even with a fairly concrete composition, I still find it dificult to piece out the details. Which way should the shadows go? How does the lighting interact with all the objects? etc. So, lately I've been using more 3D to get through that initial stage and more concretely answer these questions. The rendering you see, although pretty crude, really solidifies these questions.",
        "![Flipped progress painting](art/still-render.webp)",
        "At this point, I start to not particularly like the placement of the snake. In my original sketch, it's wrapped around the hand and hissing at the viewer. And there are quite a number of things that are off about this placement: it's quite aggressive for an otherwise calm image, there's a lot going on just on the right side of the painting, and lastly I just don't see a coherent composition. So, I end up moving the snake into the pot of flowers, which feels right for a few reasons. It balances the composition, gives a semblance of mystery because it's partially hidden in the pot (better relating to the story-telling), and matches the calmness of the other elements.",
        "With this change and some additional work, I reached the midway point of the painting. At this stage, there's a useful technique of flipping the canvas to gain a fresh perspective. This method dates back to da Vinci, who used a mirror to reflect his drawings. When working on a piece for an extended period, it's easy to become accustomed to small mistakes, making them hard for tired eyes to notice. But by flipping the image, these mistakes become more apparent. In this case, I realize that all the objects are slightly skewed. Because I'm right-handed, everything slants to the right, which needs some correcting.",
        "![Flipped progress painting](art/still-flipped.webp)",
        "Finally, all that's left is to clean up any loose ends, adjust the hue, saturation, levels, and make any other tweaks with all the nice photoshop features.",
        "![Final still life painting](art/still-final.webp)",
        "Now that I'm coming back to write up this mini-blog, I have a couple critiques. First, the composition. It's not bad overall, but maybe I could've done more with the rule of thirds. The bust is in a kinda awkward place in the middle but also not really in the middle. Maybe pushing it to the left and slightly behind the flowers might fix the issue. Second, the colors are a bit too incoherent. There's the nice overall warm color, but the saturated red, green, and small bits of blue just pop a little too much. Maybe I should've added some more of these colors into other parts of the painting so it doesn't feel out of place."
    ]
}